petter.dot
// Eg er stor
digraph trond {
	bgcolor="#f7edd2ed" rankdir=LR
	subgraph cluster_commit {
		fillcolor="#c7c7c7" label=commits style=filled
		C1 [label="Commit 1"]
		C2 [label="Commit 2"]
	}
	subgraph cluster_tree {
		node [shape=box]
		fillcolor="#adada1" label=trees style=filled
		T1 [label=<<table border="0" cellspacing="0" cellpadding="0" align="left">

<tr>
    <td align="left" colspan="2" >Tree 54312</td>
     
  </tr>
  <tr >
    <td align="left" >2343#3</td>
     <td align="left"  >trond.txt</td>
  </tr>
  <tr>
    <td align="left" >343sd#3</td>
     <td align="left"  >second row</td>
  </tr>
</table>>]
		T2 [label=<<table border="0" cellspacing="0" cellpadding="0" align="left">

<tr>
    <td align="left" colspan="2" >Tree 54312</td>
     
  </tr>
  <tr >
    <td align="left" >2343#3</td>
     <td align="left"  >trond.txt</td>
  </tr>
  <tr>
    <td align="left" >343sd#3</td>
     <td align="left"  >second row</td>
  </tr>
</table>> color=blue]
		T3 [label=<<table border="0" cellspacing="0" cellpadding="0" align="left">

<tr>
    <td align="left" colspan="2" >Tree 54312</td>
     
  </tr>
  <tr >
    <td align="left" >2343#3</td>
     <td align="left"  >trond.txt</td>
  </tr>
  <tr>
    <td align="left" >343sd#3</td>
     <td align="left"  >second row</td>
  </tr>
</table>>]
	}
	subgraph cluster_blob {
		node [shape=box]
		fillcolor="#cfdbc3" label=blobs style=filled
		B1 [label=Blob1]
		B2 [label=Blob2]
	}
	C1 -> C2
	C1 -> T1 [color="#a37575"]
	C2 -> T2 [color=green]
	T1 -> B1 [color=green]
	T2 -> B1 [color=blue]
	T2 -> B2 [color=blue]
	T2 -> T3
	T3 -> B1
}
